Stats/Isolation/Native/net_2.log
receiver: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
sender: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
fio-2.2.8
Starting 2 processes

receiver: (groupid=0, jobs=1): err= 0: pid=1926: Sun Feb 21 17:22:05 2016
  read : io=10240MB, bw=1137.7Mbit/s, iops=36386, runt= 72045msec
    clat (usec): min=12, max=137, avg=25.97, stdev= 1.12
     lat (usec): min=13, max=137, avg=26.11, stdev= 1.12
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   25], 10.00th=[   25], 20.00th=[   25],
     | 30.00th=[   25], 40.00th=[   25], 50.00th=[   26], 60.00th=[   26],
     | 70.00th=[   26], 80.00th=[   27], 90.00th=[   27], 95.00th=[   27],
     | 99.00th=[   30], 99.50th=[   31], 99.90th=[   33], 99.95th=[   33],
     | 99.99th=[   34]
    bw (Mbit/s): min=    0, max= 1177, per=100.00%, avg=1129.25, stdev=99.46
    lat (usec) : 20=0.01%, 50=100.00%, 100=0.01%, 250=0.01%
  cpu          : usr=12.53%, sys=54.53%, ctx=2621514, majf=0, minf=107
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2621440/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sender: (groupid=0, jobs=1): err= 0: pid=1927: Sun Feb 21 17:22:05 2016
  write: io=10240MB, bw=1137.7Mbit/s, iops=36386, runt= 72045msec
    clat (usec): min=23, max=119, avg=26.02, stdev= 1.11
     lat (usec): min=23, max=120, avg=26.20, stdev= 1.12
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   25], 10.00th=[   25], 20.00th=[   25],
     | 30.00th=[   25], 40.00th=[   26], 50.00th=[   26], 60.00th=[   26],
     | 70.00th=[   27], 80.00th=[   27], 90.00th=[   27], 95.00th=[   28],
     | 99.00th=[   30], 99.50th=[   31], 99.90th=[   33], 99.95th=[   33],
     | 99.99th=[   34]
    bw (Mbit/s): min= 1081, max= 1177, per=100.00%, avg=1137.09, stdev=31.35
    lat (usec) : 50=100.00%, 100=0.01%, 250=0.01%
  cpu          : usr=10.39%, sys=53.20%, ctx=2621509, majf=0, minf=113
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2621440/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: io=10240MB, aggrb=1137.7Mbit/s, minb=1137.7Mbit/s, maxb=1137.7Mbit/s, mint=72045msec, maxt=72045msec
  WRITE: io=10240MB, aggrb=1137.7Mbit/s, minb=1137.7Mbit/s, maxb=1137.7Mbit/s, mint=72045msec, maxt=72045msec